// --- Disease Information Data (Refined & Precise) ---
final Map<String, Map<String, String>> diseaseInfo = {
  'cocci': {
    'name': 'রক্ত আমাশয় (Coccidiosis)',
    'symptoms':
        '• মলের সাথে তাজা রক্ত বা কফি রঙের পায়খানা\n• পালক উস্কোখুস্কো ও শরীর দুর্বল\n• মুরগি দলবেঁধে ঝিমায়\n• পানি গ্রহণ কমে যায়',
    'prevention':
        '• লিটার (বিছানা) সম্পূর্ণ শুকনো রাখা\n• খামারের আর্দ্রতা কমানো\n• কক্সিডিওস্ট্যাট যুক্ত খাবার ব্যবহার',
    'treatment':
        '• চিকিৎসকের পরামর্শে টল্ট্রাজুরিল (Toltrazuril) বা এমপ্রোলিয়াম ব্যবহার\n• পানিতে ভিটামিন-কে ও স্যালাইন প্রদান',
  },
  'ncd': {
    'name': 'রানীক্ষেত (Newcastle Disease)',
    'symptoms':
        '• চুনের মতো বা সবুজাভ পাতলা পায়খানা\n• ঘাড় বাঁকা হয়ে যাওয়া বা ঘাড় মোচড়ানো (nervous sign)\n• হাঁ করে শ্বাস নেওয়া ও শব্দ করা\n• ডিমের খোসা পাতলা ও আকৃতি নষ্ট হওয়া',
    'prevention':
        '• সঠিক বয়সে বিসিআরডিভি (BCRDV) ও আরডিভি (RDV) টিকা প্রদান\n• খামারে জীবনিরাপত্তা জোরদার করা',
    'treatment':
        '• ভাইরাসের কোনো চিকিৎসা নেই\n• সেকেন্ডারি ইনফেকশন রোধে এন্টিবায়োটিক ও রোগ প্রতিরোধে ভিটামিন-সি/ই ব্যবহার\n• আক্রান্ত মুরগি দ্রুত আলাদা করা',
  },
  'salmo': {
    'name': 'সালমোনেলা (Salmonella/Pullorum)',
    'symptoms':
        '• সাদা রঙের আঠালো বা চুনা পায়খানা\n• পায়খানার রাস্তা মলে বন্ধ হয়ে যাওয়া (Vent pasting)\n• জয়েন্ট ফুলে যাওয়া ও খোঁড়ানো\n• বাচ্চার নাভি কাঁচা থাকা',
    'prevention':
        '• সুস্থ প্যারেন্টস স্টক থেকে বাচ্চা সংগ্রহ\n• খামার ইঁদুরমুক্ত রাখা\n• পানির পাত্র জীবাণুমুক্ত রাখা',
    'treatment':
        '• চিকিৎসকের পরামর্শে এনরোফ্লক্সাসিন বা এমোক্সিসিলিন গ্রুপ এর ওষুধ ব্যবহার\n• লিভার টনিক ও প্রোবায়োটিক প্রদান',
  },
  'healthy': {
    'name': 'সুস্থ মুরগি (Healthy)',
    'symptoms':
        '• চোখ উজ্জ্বল ও চনমনে ভাব\n• পালক মসৃণ ও সাজানো\n• স্বাভাবিক খাবার ও পানি গ্রহণ',
    'prevention':
        '• নিয়মিত সুষম খাবার ও বিশুদ্ধ পানি\n• সঠিক সময়ে সব টিকা প্রদান',
    'treatment': '• চিকিৎসার প্রয়োজন নেই, নিয়মিত যত্ন নিন।',
  },

  'pcrhealthy': {
    'name': 'সুস্থ মুরগি (Healthy)',
    'symptoms':
        '• চোখ উজ্জ্বল ও চনমনে ভাব\n• পালক মসৃণ ও সাজানো\n• স্বাভাবিক খাবার ও পানি গ্রহণ',
    'prevention':
        '• নিয়মিত সুষম খাবার ও বিশুদ্ধ পানি\n• সঠিক সময়ে সব টিকা প্রদান',
    'treatment': '• চিকিৎসার প্রয়োজন নেই, নিয়মিত যত্ন নিন।',
  },
};
